app/controllers/banks_controller.rb

SELECT  "packs".* FROM "packs" WHERE "packs"."user_id" = $1 AND "packs"."active" = $2 LIMIT 1  [["user_id", 1], ["active", "t"]]
---
  def index
     if current_user
      @current_pack = current_user.packs.find_by(active: true)