app/controllers/cigs_controller.rb

INSERT INTO "banks" ("user_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["value", "0.627"], ["created_at", "2016-04-20 19:00:36.177340"], ["updated_at", "2016-04-20 19:00:36.177340"]]
SELECT "phrases".* FROM "phrases"
---
  def positive
    @bank = Bank.new(user: current_user, value: getprice)
    @bank.save
    @phrases = Phrase.all

INSERT INTO "banks" ("user_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["value", "-0.5"], ["created_at", "2016-04-20 19:04:17.445807"], ["updated_at", "2016-04-20 19:04:17.445807"]]
SELECT "phrases".* FROM "phrases"
---
  def negative
    @bank = Bank.new(user: current_user, value: ((getprice) * -1))
    @bank.save
    @phrases = Phrase.all