app/controllers/packs_controller.rb

  def create
    user_packs = Pack.where(user: current_user)
    user_packs.each do |pack|
      pack.active = false
      pack.save
---
SELECT "packs".* FROM "packs" WHERE "packs"."user_id" IS NULL
INSERT INTO "packs" ("price_pack", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["price_pack", "10.0"], ["user_id", 1], ["created_at", "2016-04-20 16:45:45.973598"], ["updated_at", "2016-04-20 16:45:45.973598"]]
UPDATE "packs" SET "active" = $1, "updated_at" = $2 WHERE "packs"."id" = $3  [["active", "t"], ["updated_at", "2016-04-20 16:46:10.705041"], ["id", 3]]